web/app/controllers/wines_controller.rb

  def index
    @wines = Wine.all
---
SELECT "wines".* FROM "wines"

  def show
    @wine = Wine.find(params[:id])
---
SELECT "wines".* FROM "wines" WHERE "wines"."wine_id" = ? LIMIT 1  [["wine_id", "1"]]

  def edit
    @wine = Wine.find(params[:id])
---
SELECT "wines".* FROM "wines" WHERE "wines"."wine_id" = ? LIMIT 1  [["wine_id", "1"]]

  def create
    @wine = Wine.new(params[:wine])
    @wines = Wine.all

    respond_to do |format|
      if @wine.save
---
SELECT "wines".* FROM "wines"
INSERT INTO "wines" ("comments", "created_at", "price", "updated_at", "wine_id", "wine_name") VALUES (?, ?, ?, ?, ?, ?)