web/app/controllers/wines/analyze_controller.rb

  def show

    @wines = Wine.all
    @wine = Wine.find(params[:id])

    @analyze_results = AnalyzeResult.find_all_by_wine_id(params[:id])
    @wine.analyze_results_info = CorrelationAnalyzer::create_analyze_result_info(params[:id])
---
SELECT "wines".* FROM "wines" WHERE "wines"."wine_id" = ? LIMIT 1  [["wine_id", "1"]]
SELECT "analyze_results".* FROM "analyze_results" WHERE "analyze_results"."wine_id" = '17' LIMIT 1
INSERT INTO "analyze_results" ("count", "created_at", "remarks", "updated_at", "wine_id", "word") VALUES (?, ?, ?, ?, ?, ?)  [["count", nil], ["created_at", Tue, 02 Apr 2013 10:02:34 UTC +00:00], ["remarks", nil], ["updated_at", Tue, 02 Apr 2013 10:02:34 UTC +00:00], ["wine_id", nil], ["word", nil]]